# ReferenceType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolicCurve..::..ReferenceType Property
SymbolicCurve Class See Also
---
Indicates the type of reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ReferenceType ReferenceType { get; set; }
```

Visual Basic
---
```text
Public Property ReferenceType As ReferenceType
	Get
	Set
```

Visual C++
---
```text
public:
property ReferenceType ReferenceType {
	ReferenceType get ();
	void set (ReferenceType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when argument is out of range. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when regeneration failed. |

# See Also
SymbolicCurve Class
Autodesk.Revit.DB Namespace